#include <stdio.h>
// Написать и запустить программу, выводящую строку “Hello, World!” в терминал на языке программирования C.

int main() {
	printf("Hello World!\n");
	return 0;
}